---
kind: property
id: P:Autodesk.Revit.DB.GBXMLExportOptions.ExportEnergyModelType
source: html/e0b8443f-e415-271a-5c9f-3c99cca13406.htm
---
# Autodesk.Revit.DB.GBXMLExportOptions.ExportEnergyModelType Property

The energy model type from which gbXML will be exported.

## Syntax (C#)
```csharp
public ExportEnergyModelType ExportEnergyModelType { get; set; }
```

## Remarks
Default value is SpatialElement.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration